Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Out of the box, it provides integrations with Hashicorp Consul, Eureka, and Kubernetes and brings in a couple of load-balancer (handling the service selection) implementations, such as round-robin. But the most significant strength of Stork is its extensibility. You can plug your own service discovery mechanism or implement your own, maybe business-related, service selection strategy.
ja_jp: 最初からHashicorp Consul、Eureka、Kubernetesとの統合が提供されており、ラウンドロビンなどのロードバランサー（サービス選択の処理）の実装もいくつか持ち込まれています。しかし、Storkの最も大きな強みは、その拡張性です。独自のサービス発見メカニズムをプラグインしたり、独自の、おそらくビジネスに関連したサービス選択戦略を実装することができます。

source: Out of the box, the generated resources will be annotated with version control related information that can be used either by tooling, or by the user for troubleshooting purposes.
ja_jp: 生成されたリソースにはバージョン管理に関連する情報がアノテーションされ、ツールによって、またはユーザーがトラブルシューティングの目的で使用することができます。

source: Out of the box, your subtype of `PanacheEntity` will be managed by Hibernate ORM, and every change to the entity will be automatically sent to the database without requiring any explicit `update` operation.
ja_jp: デフォルトでは、`PanacheEntity` のサブタイプは Hibernate ORM によって管理され、エンティティーに対するすべての変更は、明示的な `update` 操作を必要とせずに自動的にデータベースに送信されます。

source: Out-of-the-box Jackson serialization converts objects into their JSON representation by introspecting them through a heavy use of reflection. However, the general Quarkus philosophy is to avoid reflection as much as possible, often replacing it with build time code generation. For this reason it is possible to automatically generate at build time implementations of the Jackson `StdSerializer`, one for each class to be converted in JSON. These generated serializers can be subsequently used by Quarkus at runtime to perform the JSON serialization of the objects returned by a REST endpoint without any use of reflection.
ja_jp: 標準の Jackson シリアライズでは、オブジェクトを JSON 表現に変換する際に、大量のリフレクションを使用してオブジェクトを調査します。しかし、Quarkus の基本的な方針としては、可能な限りリフレクションの使用を避け、代わりにビルド時のコード生成を活用することが一般的です。 このため、Jackson の `StdSerializer` の実装をビルド時に自動生成し、JSON に変換する各クラスごとに専用のシリアライザを作成することが可能です。生成されたシリアライザは、Quarkus によって実行時に使用され、REST エンドポイントから返されるオブジェクトの JSON シリアライズをリフレクションを一切使用せずに実行できます。

source: Outbound Metadata
ja_jp: アウトバウンドメタデータ

source: Outgoing Attributes of the 'smallrye-kafka' connector
ja_jp: 'smallrye-kafka' connector の Outgoing 属性

source: Outgoing Attributes of the 'smallrye-pulsar' connector
ja_jp: 'smallrye-pulsar' コネクターの発信属性

source: Outgoing channel configuration
ja_jp: 発信チャネル設定

source: Outgoing channel configuration (publishing to Pulsar)
ja_jp: 発信チャネルの設定 (Pulsar への公開)

source: Outgoing channel configuration (writing to Kafka)
ja_jp: outgoingチャンネルの設定（Kafkaへの書き込み)

source: Outgoing channels (SubscriberDecorator):
ja_jp: 発信チャネル (SubscriberDecorator):

source: Outline steps
ja_jp: 概略手順

source: Outline the recommended steps for making successful contributions to Quarkus documentation.
ja_jp: Quarkus ドキュメントへの貢献を成功させるための推奨ステップを概説します。

source: Output locations
ja_jp: 出力先

source: Output will vary depending on the build tool your project is using (Maven, Gradle, or JBang).
ja_jp: 出力は、プロジェクトが使用しているビルドツール（Maven、Gradle、またはJBang）によって異なります。

source: Output with `quarkus.qute.remove-standalone-lines=false`
ja_jp: `quarkus.qute.remove-standalone-lines=false` での出力

source: Outputs `true` if any of the parts is not `falsy` as described in the <<if_section>>. The parameter is only evaluated if needed.
ja_jp: <<if_section>> で説明したように、いずれかのパーツが `falsy` でない場合に `true` を出力します。このパラメーターは必要な場合のみ評価されます。

source: Outputs `true` if any of the parts is not `falsy` as described in the xref:if_section[If Section]. The parameter is only evaluated if needed.
ja_jp: xref:if_section[If セクション] で説明したように、いずれかのパーツが `falsy` でない場合、 `true` を出力します。パラメータは必要な場合のみ評価されます。

source: Outputs `true` if both parts are not `falsy` as described in the <<if_section>>. The parameter is only evaluated if needed.
ja_jp: <<if_section>> で説明したように、両方のパーツが `falsy` でない場合に `true` を出力します。このパラメーターは必要な場合にのみ評価されます。

source: Outputs `true` if both parts are not `falsy` as described in the xref:if_section[If Section]. The parameter is only evaluated if needed.
ja_jp: xref:if_section[If セクション] で説明したように、両方のパートが `falsy` でない場合、 `true` を出力します。パラメータは必要な場合のみ評価されます。

source: Outputs `true` if the base object is equal to the argument.
ja_jp: ベースオブジェクトが引数と等しい場合、`true` を出力します。

source: Outputs an empty list if the previous part cannot be resolved or resolves to `null`.
ja_jp: 前のパーツが解決できなかったり、 `null` に解決された場合に空のリストを出力します。

source: Outputs the default value if the previous part cannot be resolved or resolves to `null`.
ja_jp: 前のパーツが解決できなかったり、 `null` に解決された場合のデフォルト値を出力します。

source: Outputs the first element of the array.
ja_jp: 配列の最初の要素を出力します。

source: Outputs the first two elements of the array.
ja_jp: 配列の最初の 2 要素を出力します。

source: Outputs the length of the array.
ja_jp: 配列の長さを出力します。

source: Outputs the second element of the array using the bracket notation.
ja_jp: ブラケット表記で配列の 2 つ目の要素を出力します。

source: Outputs the third element of the array via the virtual method `get()`.
ja_jp: 配列の 3 番目の要素を仮想メソッド `get()` で出力します。

source: Outside of this use-case, just use `@Identifier`.
ja_jp: このユースケース以外では、`@Identifier` を使用してください。

source: Over 60% of our codebase has been migrated and it is less than half the size of the original equivalent codebase. We deploy numerous times an hour/day into preview and staging environments and the average turn-around is half the time it used to take us.
ja_jp: 当社のコードベースの60％以上が移行され、元の同等のコードベースの半分以下のサイズになりました。プレビュー環境やステージング環境へのデプロイは1日1時間に何度も行われていますが、平均所要時間は以前の半分になりました。

source: Over the past five months, we've been *really* hard at work to improve Quarkus Tools in every possible way, averaging about one release every two weeks.
ja_jp: この5ヶ月間、私たちはQuarkus Toolsを可能な限り改善するため、平均して2週間に1つのペースでリリースを行うなど、 *本当に* 懸命に取り組んできました。

source: Over the time, many extensions have been developed to provide observability capabilities to Quarkus applications. This guide will provide an overview of the observability extensions available in Quarkus and which can be used to provide observability according to the needs of your Quarkus application.
ja_jp: これまで、Quarkus アプリケーションにオブザーバビリティー機能を提供するためのエクステンションが数多く開発されてきました。このガイドでは、Quarkus で利用できるオブザーバビリティーエクステンションの概要と、Quarkus アプリケーションのニーズに応じてオブザーバビリティーを提供するために使用できるエクステンションについて説明します。

source: Overall Architecture
ja_jp: 全体アーキテクチャ

source: Overall, the move to Quarkus has been a very positive experience, with real benefits in terms of developer productivity and operational efficiency. The team has been using Quarkus in production for the Adoptium API since November 2019 and has proved to be extremely stable.
ja_jp: 全体的に見て、Quarkusへの移行は、開発者の生産性や運用効率の面で実際にメリットがあり、非常にポジティブな経験となりました。チームは2019年11月からAdoptium APIの本番でQuarkusを使用しており、非常に安定していることを示しました。

source: Overall, we have been very impressed with the capabilities of Quarkus, and our experience with the Quarkus community has been fantastic. We look forward to seeing how it evolves, and improving how we serve the Java community’s Java distribution needs for years to come!
ja_jp: 全体的に見て、Quarkusの機能には非常に感銘を受けましたし、Quarkusコミュニティでの経験も素晴らしいものでした。今後もQuarkusがどのように進化していくのか、また、JavaコミュニティのJavaディストリビューションのニーズに応える方法を改善していくことを楽しみにしています。

source: Overload detection
ja_jp: 過負荷検出

source: Override the content_type attribute of the incoming message, should be a valid MIME type Type: _string_
ja_jp: 受信メッセージのcontent_type属性をオーバーライドします。有効なMIMEタイプであるべきです。 Type: _string_

source: Override the content_type attribute of the incoming message, should be a valid MINE type Type: _string_
ja_jp: 受信メッセージのcontent_type属性をオーバーライドする、有効なMINEタイプであること Type: _string_

source: Override the default JAR name to the one generated by the Quarkus Maven plugin
ja_jp: デフォルトのJAR名を、Quarkus Mavenプラグインによって生成されたものにオーバーライドします。

source: Override the default `Boolean` converter and use the provided converter which accepts a `YES` or `NO` config values.
ja_jp: デフォルトの `Boolean` コンバーターをオーバーライドし、 `YES` または `NO` 設定値を受け入れる提供されたコンバーターを使用します。

source: Overrides the `@Dependent` scope declared on the `@Mock` stereotype.
ja_jp: `@Mock` ステレオタイプで宣言された `@Dependent` スコープをオーバーライドします。

source: Overriding
ja_jp: オーバーライド

source: Overriding a registry URL
ja_jp: レジストリのURLを上書きする

source: Overriding property names
ja_jp: プロパティ名のオーバーライド

source: Overriding the Infinispan Server Image
ja_jp: Infinispanサーバーイメージのオーバーライド

source: Overriding the MariaDB/MySQL configuration would be done as follows:
ja_jp: MariaDB/MySQL の設定を上書きする場合は、以下を実行します。

source: Overriding the Quarkus BOM Kotlin version (Gradle)
ja_jp: Quarkus BOMのKotlin versionをオーバーライドする（Gradle）

source: Overriding the default behaviour
ja_jp: デフォルトの動作のオーバーライド

source: Overriding the default registry Maven repository configuration
ja_jp: デフォルトのレジストリMavenリポジトリ設定の上書き

source: Overriding the propagated contexts using CDI injection
ja_jp: CDIインジェクションを用いた伝搬されたコンテキストのオーバーライド

source: Overriding the propagated contexts using annotations
ja_jp: 伝播されたコンテキストをアノテーションで上書き

source: Overriding which contexts are propagated
ja_jp: どのコンテキストが伝搬されるかをオーバーライドする

source: Overview
ja_jp: 概要

source: Overview of RunStages
ja_jp: RunStages の概要

source: Overview of concepts underlying the structure and composition of Quarkus docs.
ja_jp: Quarkus ドキュメントの構造と構成の基礎となるコンセプトの概要。

source: Overview of supported authentication mechanisms
ja_jp: サポートされる認証メカニズムの概要

source: Overview of the Bearer token authentication mechanism in Quarkus
ja_jp: Quarkusのベアラートークン認証メカニズムの概要

source: Overview of the OIDC authorization code flow mechanism
ja_jp: OIDC 認可コードフローメカニズムの概要

source: Overview of the Quarkus Security architecture
ja_jp: Quarkus Securityのアーキテクチャの概要

source: Overview of {openshift} build strategies
ja_jp: {openshift} ビルドストラテジーの概要

source: PEM key format support
ja_jp: PEM キーフォーマットサポート

source: PEM keystores
ja_jp: PEM キーストア

source: PEM truststores
ja_jp: PEM トラストストア

source: PEM truststores are composed of a list of `.crt` or `.pem` files. Each of them contains a certificate.
ja_jp: PEM トラストストアは、`.crt` または `.pem` ファイルのリストで構成されます。 それぞれに証明書が含まれています。

source: PKCS#1 RSA private key (unencrypted)
ja_jp: PKCS#1 RSA 秘密鍵 (非暗号化)

source: PKCS#8 private key (unencrypted)
ja_jp: PKCS#8 秘密鍵 (非暗号化)

source: PKCS12 keystores
ja_jp: PKCS12 キーストア

source: PKCS12 keystores are single files that contain the certificate and the private key.
ja_jp: PKCS12 キーストアは、証明書と秘密鍵を含む単一のファイルです。

source: PKCS12 truststores
ja_jp: PKCS12 トラストストア

source: PKCS12 truststores are a single file containing the certificates. You can use the alias to select the appropriate certificate when multiple certificates are included.
ja_jp: PKCS12 トラストストアは、証明書を含む単一のファイルです。 複数の証明書が含まれている場合は、エイリアスを使用して適切な証明書を選択できます。

source: PKCS12 truststores are single-file containers for certificates. You can use the alias to select the appropriate certificate when multiple certificates are included.
ja_jp: PKCS12 トラストストアは、証明書を格納する単一ファイルのコンテナーです。複数の証明書が含まれている場合は、エイリアスを使用して適切な証明書を選択できます。

source: PLAIN (recommended only in combination with TLS encryption)
ja_jp: PLAIN（TLS暗号化との併用のみ推奨）

source: PLease be aware that supporting the back-channel logout option requires managing a cache of pending back-channel notifications. It may take awhile to clear them as it requires a user whose back-channel logout is pending to access Quarkus. The more users your application deals with, the larger the cache size can be.
ja_jp: バックチャネルログアウトオプションをサポートするには、保留中のバックチャネル通知のキャッシュを管理する必要があることに注意してください。これらをクリアするには、バックチャネルログアウトが保留されているユーザーが Quarkus にアクセスする必要があるため、時間がかかる場合があります。アプリケーションが扱うユーザー数が多いほど、キャッシュサイズが大きくなる可能性があります。

source: PMML file
ja_jp: PMMLファイル

source: POJO classes which will be serialized via JSON
ja_jp: JSON 経由でシリアライズされる POJO クラス

source: POST form request to `/user`, CSRF token verification is enforced by the CSRF filter
ja_jp: `/user` へのPOSTフォームのリクエスト、CSRFフィルターによりCSRFトークンの検証が行われます。

source: POST json request to `/user`, CSRF token verification is not needed
ja_jp: `/user` への POST json リクエスト , CSRF トークン検証は不要です。

source: POST json request to `/users`, CSRF token verification is not needed
ja_jp: `/users` への POST json リクエスト , CSRF トークン検証は不要です。

source: POST query
ja_jp: POST クエリー

source: Package and deploy your application to the current {openshift} project:
ja_jp: アプリケーションをパッケージ化し、現在の {openshift} プロジェクトにデプロイします：

source: Package and run the application
ja_jp: アプリケーションをパッケージ化して実行する

source: Package your Java {jdk-ver-latest} application, by entering the following command:
ja_jp: 以下のコマンドを入力して、Java {jdk-ver-latest} アプリケーションをパッケージ化します：

source: Package your Java {jdk-version-other} application, by entering the following command:
ja_jp: 以下のコマンドを入力して、Java {jdk-version-other}アプリケーションをパッケージ化します：

source: Package your application using the standard `mvn clean package` command. The result of the previous command is a single JAR file inside the `target/deployment` directory that contains the classes and the dependencies of the project.
ja_jp: 標準の `mvn clean package` コマンドを使用して、アプリケーションをパッケージ化します。前述のコマンドの結果、 `target/deployment` ディレクトリ内に、プロジェクトのクラスと依存関係を含む単一の JAR ファイルが作成されます。

source: Package your application, by entering the following command:
ja_jp: 以下のコマンドを入力して、アプリケーションをパッケージ化します。

source: Package your scripts (js, ts), styles (css, scss), and web dependencies together using a bundler (see xref:#bundling[below]).
ja_jp: バンドラーを使用して、スクリプト (js、ts)、スタイル (css、scss)、および Web 依存関係をパッケージ化します (xref:#bundling[下記] を参照)。

source: Packaging And Releasing With JReleaser
ja_jp: JReleaser によるパッケージングとリリース

source: Packaging and Running the application
ja_jp: アプリケーションのパッケージ化と実行

source: Packaging and run the application
ja_jp: パッケージ化とアプリケーションの実行

source: Packaging and running in JVM mode
ja_jp: JVMモードでのパッケージ化と実行

source: Packaging and running the application does not change either.
ja_jp: アプリケーションのパッケージ化と実行も同様に差異はありません。

source: Packaging as a Native Image distribution
ja_jp: ネイティブイメージでの配布

source: Packaging of the application
ja_jp: アプリケーションのパッケージ化

source: Packaging the application
ja_jp: アプリケーションのパッケージング

source: Packaging the application and run several instances
ja_jp: アプリケーションのパッケージ化と複数のインスタンスの実行

source: Packaging the native executable in a container
ja_jp: ネイティブ実行可能ファイルのコンテナーへのパッケージング

source: Packaging your application
ja_jp: アプリケーションのパッケージ化

source: Page
ja_jp: ページ

source: Page Area (Main Content)
ja_jp: ページ領域 (メインコンテンツ)

source: Page size. Minimal accepted value is 1. Any lower value is interpreted as 1.
ja_jp: ページサイズ。最小値は1で、それ以下の値は1と解釈されます。

source: Page titles
ja_jp: ページタイトル

source: Pages are modular and dynamically loaded. Extensions can contribute custom pages written using Web Components and interact with the backend via JSON-RPC.
ja_jp: ページはモジュラーで動的にロードされます。エクステンションは、Web Components を使用して記述されたカスタムページを提供し、JSON-RPC を介してバックエンドと対話できます。

source: Paging
ja_jp: ページング

source: PagingAndSortingRepository and JpaRepository
ja_jp: PagingAndSortingRepository と JpaRepository

source: Paired with corresponding Java methods, built-in Java classes also have built-in Qute value resolvers made available by the Qute templating engine that are evaluated and output, or resolve to, a value. Quarkus Tools for IntelliJ supports completion, hover and snippet generation for these built-in value resolvers.
ja_jp: 対応するJavaメソッドと対になっている組み込みのJavaクラスには、Quteテンプレートエンジンによって利用可能な組み込みのQute値リゾルバがあり、評価されて値を出力、または値に解決します。Quarkus Tools for IntelliJは、これらの組み込み値リゾルバの補完、ホバー、およびスニペット生成をサポートしています。

source: Paired with corresponding Java methods, built-in Java classes also have built-in Qute value resolvers made available by the Qute templating engine that is evaluated and outputs, or resolves to, a value. Quarkus Tools for Visual Studio Code supports completion, hover and snippet generation for these built-in value resolvers.
ja_jp: 対応するJavaメソッドと対になって、組み込みのJavaクラスは、Quteテンプレートエンジンによって利用可能になった組み込みのQute値リゾルバを持ち、評価されて値を出力、または値に解決します。Quarkus Tools for Visual Studio Codeは、これらの組み込み値リゾルバの補完、ホバー、スニペット生成をサポートしています。

source: Panache Next is our next generation of Panache that brings a better developer experience and new features. While relying on the same underlying concepts as the current Panache implementation, Panache Next introduces a more intuitive API, improved type safety, and enhanced query capabilities. It also unifies the programming model between Hibernate ORM and Hibernate Reactive, stateful and stateless sessions, making it easier for developers to switch between them. Finally, it integrates seamlessly with Jakarta Data.
ja_jp: Panache Nextは、より良い開発者エクスペリエンスと新機能をもたらす次世代のPanacheです。現在のPanache実装と同じ基盤となる概念に依拠しつつ、Panache Nextはより直感的なAPI、改善された型安全性、および強化されたクエリ機能を提供します。また、Hibernate ORMとHibernate Reactive、ステートフルおよびステートレスセッション間のプログラミングモデルを統一し、開発者がそれらを簡単に切り替えられるようにします。最後に、Jakarta Dataとシームレスに統合されます。

source: Panache Query Language
ja_jp: Panache クエリー言語

source: Panache allows you to write your MongoDB entities like this:
ja_jp: Panacheでは、MongoDBのエンティティをこのように書くことができます。

source: Panache entities can be attached to only one persistence unit.
ja_jp: Panacheエンティティは1つの永続化ユニットにのみアタッチできます。

source: Panache entities using the active record pattern
ja_jp: アクティブレコードパターンを使用する Panache エンティティ

source: Panache provides direct support for database locking with your entity/repository, using `findById(Object, LockModeType)` or `find().withLock(LockModeType)`.
ja_jp: Panacheは `findById(Object, LockModeType)` や `find().withLock(LockModeType)` を使用してエンティティ/リポジトリでデータベースロックを直接サポートします。

source: Parallelization
ja_jp: 並列化

source: Parameter
ja_jp: パラメーター

source: Parameter Declaration Example
ja_jp: パラメーター宣言の例

source: Parameter Type
ja_jp: パラメータータイプ

source: Parameter declaration - maps `foo` to `org.acme.Foo`.
ja_jp: パラメーター宣言 - `foo` を `org.acme.Foo` にマップします。

source: Parameter mapping
ja_jp: パラメーターマッピング

source: Parameters
ja_jp: パラメーター

source: Parameters annotated with `@io.quarkus.test.component.SkipInject` are never resolved by this extension.
ja_jp: `@io.quarkus.test.component.SkipInject` でアノテーションが付けられたパラメーターは、このエクステンションによって解決されることはありません。

source: Parameters specified as `File`, `Path`, `byte[]` or `Buffer` are sent as files and default to the `application/octet-stream` MIME type. Other `@RestForm` parameter types default to the `text/plain` MIME type. You can override these defaults with the `@PartType` annotation.
ja_jp: `File` , `Path` , `byte[]` , `Buffer` として指定されたパラメータは、ファイルとして送信され、デフォルトで `application/octet-stream` MIME タイプになります。その他の `@RestForm` パラメータ型のデフォルトは、 `text/plain` MIMEタイプです。これらのデフォルトを上書きするには、 `@PartType` アノテーションを使用します。

source: Parameters specified as `File`, `Path`, `byte[]`, `Buffer` or `FileUpload` are sent as files and default to the `application/octet-stream` MIME type. Other `@RestForm` parameter types default to the `text/plain` MIME type. You can override these defaults with the `@PartType` annotation.
ja_jp: `File`、 `Path`、 `byte[]`、 `Buffer`、 `FileUpload` として指定されたパラメーターはファイルとして送信され、デフォルトでは `application/octet-stream` MIME 型になります。他の `@RestForm` パラメーター型はデフォルトで `text/plain` MIME 型になります。 `@PartType` アノテーションを使用して、これらのデフォルトをオーバーライドできます。

source: Parameters to `@Counted` and `@Timed` can be annotated with `@MeterTag` to dynamically assign meaningful tag values.
ja_jp: `@Counted` および `@Timed` へのパラメーターに `@MeterTag` アノテーションを付けて、意味のあるタグ値を動的に割り当てることができます。

source: Parent First Dependencies
ja_jp: 親優先の依存関係

source: Parent Profile
ja_jp: 親プロファイル

source: Parent profile
ja_jp: 親プロファイル

source: Parentheses example
ja_jp: 括弧の例

source: Parity
ja_jp: 同等性

source: Parse and Verify JsonWebToken with JWTParser
ja_jp: JWTParser を使用した JsonWebToken の解析と検証

source: Parse and verify `JsonWebToken` with `JWTParser`
ja_jp: JWTParser を使用した JsonWebToken の解析と検証

source: Parse the template definition (`io.quarkus.qute.Template`),
ja_jp: テンプレートの定義を解析する ( `io.quarkus.qute.Template` )

source: Parsed: a comment
ja_jp: パース対象: コメント

source: Parsed: an expression that starts with underscore.
ja_jp: パース対象: アンダースコアで始まる式

source: Parsing Config to Objects
ja_jp: コンフィグをオブジェクトにパースする

source: Parsing an XML Configuration into Runtime XmlConfig Instance
ja_jp: XML 設定をランタイム XmlConfig インスタンスに解析する

source: Part of the Hibernate ORM configuration is now overridable at runtime
ja_jp: HibernateのORM設定の一部が実行時にオーバーライド可能になりました。

source: Particular instrumentation components can be disabled in tracing, like ignore client requests but keep server ones. For more details, please check the xref:opentelemetry-tracing.adoc[OpenTelemetry Tracing Guide].
ja_jp: 特定の計装コンポーネントは、トレースで無効にすることができます。たとえば、クライアントリクエストを無視し、サーバーリクエストを保持することができます。詳細は、xref:opentelemetry-tracing.adoc[OpenTelemetry トレースガイド] を参照してください。

source: Parting thoughts
ja_jp: おわりに

source: Partition 0 of topic 'topic1', setting the initial position at offset 10.
ja_jp: トピック 'topic1' のパーティション 0。初期位置をオフセット 10 に設定します。

source: Partition 1 of topic 'topic2', setting the initial position at offset 20.
ja_jp: トピック 'topic2' のパーティション 1。初期位置をオフセット 20 に設定します。

source: Pass `@BeanParam` parameters into a custom permission
ja_jp: `@BeanParam` パラメーターをカスタム権限に渡す

source: Pass a `io.quarkus.arc.BeanCreator` implementation class via `ExtendedBeanConfigurator#creator(Class<? extends BeanCreator<U>>)`, and possibly specify some parameters via `ExtendedBeanConfigurator#param()`.
ja_jp: `ExtendedBeanConfigurator#creator(Class<? extends BeanCreator<U>>)` を介して `io.quarkus.arc.BeanCreator` 実装クラスを渡し、可能であれば `ExtendedBeanConfigurator#param()` を介していくつかのパラメーターを指定します。

source: Pass a contextual reference of `Bar` to the constructor of `Foo`.
ja_jp: `Bar` のコンテキスト参照を `Foo` のコンストラクターに渡します。

source: Pass a subclass of `io.quarkus.arc.BeanCreator` via `ExtendedBeanConfigurator#creator(Class<? extends BeanCreator<U>>)`, and possibly specify some build-time parameters via `ExtendedBeanConfigurator#param()` and synthetic injection points via `ExtendedBeanConfigurator#addInjectionPoint()`.
ja_jp: `ExtendedBeanConfigurator#creator(Class<? extends BeanCreator<U>>)` で `io.quarkus.arc.BeanCreator` のサブクラスを渡し、場合によっては `ExtendedBeanConfigurator#param()` でビルド時のパラメーターを、 `ExtendedBeanConfigurator#addInjectionPoint()` で合成注入ポイントを指定します。

source: Pass an extra `audience` query parameter to the Auth0 authorization endpoint during the authorization code flow redirect from Quarkus to Auth0. It will ensure that the access token is issued in the JWT format and includes an `aud` (audience) claim which will contain `https://quarkus-auth0`.
ja_jp: Quarkus から Auth0 への認可コードフローのリダイレクト中に、追加の `audience` クエリーパラメーターを Auth0 認可エンドポイントに渡します。 これにより、アクセストークンが JWT フォーマットで発行され、 `https://quarkus-auth0` を含む `aud` (オーディエンス) クレームが確実に組み込まれます。

source: Pass the content type that is expected by the search backend for bulk requests.
ja_jp: 一括リクエストに対して検索バックエンドが期待するコンテントタイプを渡します。

source: Pass the injected Qute `userEmail` template to the `ProtectedProfileHandler`.
ja_jp: 注入された Qute の `userEmail` テンプレートを `ProtectedProfileHandler` に渡します。

source: Pass the name of the non-default persistence unit to the repository annotation (`other` in this example).
ja_jp: デフォルト以外の永続化ユニットの名前をリポジトリーアノテーションに渡します (この例では `other`)。

source: Passing application configuration
ja_jp: アプリケーション設定の受け渡し

source: Passing build-time information
ja_jp: ビルドタイム情報を渡す

source: Passing information to your templates
ja_jp: テンプレートに情報を渡す

source: Passing recorded data to the UI work the same as the above deployment classpath, except rather than a function, you pass the RuntimeValue (returned from your recorder)
ja_jp: 記録されたデータを UI に渡す方法は、上記のデプロイメントクラスパスと同じですが、関数ではなく RuntimeValue (レコーダーから返されるもの) を渡します。

source: Passing run-time information
ja_jp: ランタイム情報を渡す

source: Passivation and passivating scopes are not supported
ja_jp: パッシベーションおよびパッシベーションスコープはサポートされていません。

source: Password
ja_jp: パスワード

source: Password Grant
ja_jp: パスワード・グラント

source: Password grant
ja_jp: パスワード・グラント

source: Password of SOCKS5 proxy.
ja_jp: SOCKS5プロキシのパスワード。

source: Password of TLS KeyStore.
ja_jp: TLS KeyStoreのパスワード。

source: Password of TLS TrustStore.
ja_jp: TLS TrustStoreのパスワード。
